app/controllers/tasks_controller.rb

    task = Task.find(params[:id])
    task.update!(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "コッペパン"], ["description", "あんまん"], ["updated_at", "2021-07-28 12:55:57.749342"], ["id", 2]]

    task = Task.new(task_params)
    task.save!
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["description", ""], ["created_at", "2021-07-28 13:08:39.299013"], ["updated_at", "2021-07-28 13:08:39.299013"]]